# GetClUseTextStyle

## Description
Function GetClUseTextStyle returns whether the text style of the specified class is used at object creation.

```pascal
FUNCTION GetClUseTextStyle(className : STRING) : BOOLEAN;
```

```python

def vs.GetClUseTextStyle(className):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Name of class|

## See Also
VS Functions:
SetClUseTextStyle| SetClTextStyleRef| GetClTextStyleRef

## Version
Availability: from Vectorworks 2015
## Category
* Classes